## PANDAS

In [3]:
import pandas as pd 
import numpy as np

In [4]:
#playing with dataframes
#index should be given based on no of rows
#columns should be given based on no. of cols 
#format is data,index,column



df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=["Column1","Column2","Column3","Column4"])

In [5]:
df.head()

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [6]:
#converting into excel sheet

df.to_csv('Test1.csv')             #csv means comma separated

In [7]:
#accessing the elements 
#index location of elements 
#first row will be displayed

df.loc['Row1']

Column1    0
Column2    1
Column3    2
Column4    3
Name: Row1, dtype: int32

In [8]:
#Check the type
#type is Series bcs only one Row


type(df.loc['Row1'])

pandas.core.series.Series

In [9]:
#Data Frames are combination of many rows n cols,atleast should be greater than one col and one row
#Data Series can either be any one row or any one column

In [10]:
#gives location of all rows n cols 
#[:,:].....LHS gives rows n RHS gives cols


df.iloc[:,:]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [11]:
#In python,index starts with 0 always 
#0:2 will get first two rows 
#0:1 get only one cols 

df.iloc[0:2,0:1]

      Column1
Row1        0
Row2        4

In [12]:
df.iloc[0:3,0:4]

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11

In [13]:
type(df.iloc[0:2,0:2]).........## more than one row and column,hence type is data frame

SyntaxError: invalid syntax (1084363068.py, line 1)

In [14]:
type(df.loc['Row1'])

pandas.core.series.Series

In [15]:
df.iloc[0:2,0]

Row1    0
Row2    4
Name: Column1, dtype: int32

In [16]:
#this thing is very confusing
#if we hv atleast more than one column,it will become a dataframe  
#if we have only rows then it is data series....check next example


type(df.iloc[0:2,0])

pandas.core.series.Series

In [17]:
type(df.iloc[0:4,0])

pandas.core.series.Series

In [18]:
#Taking elements from col2 not showing col1

df.iloc[:,1:]

      Column2  Column3  Column4
Row1        1        2        3
Row2        5        6        7
Row3        9       10       11
Row4       13       14       15
Row5       17       18       19

In [19]:
#convert dataframes into array
#.values is converting 

df.iloc[:,1:].values

array([[ 1,  2,  3],
       [ 5,  6,  7],
       [ 9, 10, 11],
       [13, 14, 15],
       [17, 18, 19]])

In [20]:
df.iloc[:,1:].values.shape...........## gives no.of (rows n cols)

SyntaxError: invalid syntax (1707915598.py, line 1)

In [21]:
#checking null values 


df.isnull().sum()

Column1    0
Column2    0
Column3    0
Column4    0
dtype: int64

In [22]:
df['Column1'].value_counts()

0     1
4     1
8     1
12    1
16    1
Name: Column1, dtype: int64

In [23]:
df['Column1'].unique()

array([ 0,  4,  8, 12, 16])

In [24]:
df

      Column1  Column2  Column3  Column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [25]:
df['Column3']

Row1     2
Row2     6
Row3    10
Row4    14
Row5    18
Name: Column3, dtype: int32

In [26]:
type(df['Column3'])

pandas.core.series.Series

In [27]:
df[['Column3','Column4']]

      Column3  Column4
Row1        2        3
Row2        6        7
Row3       10       11
Row4       14       15
Row5       18       19

In [28]:
from io import StringIO,BytesIO

In [29]:
data=('col1,col2,col3\n'
     'x,y,1\n'
      'a,b,2\n'
      'c,d,3')

In [30]:
type(data)

str

In [31]:
StringIO()

In [32]:
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [33]:
#Reading from specific columns 

df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [34]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [35]:
#converting into excel sheet

df.to_csv('Test.csv')

In [36]:
data=('a,b,c,d\n'
     '1,2,3,4\n'
      '5,6,7,8\n'
      '9,10,11,12')

In [37]:
print(data)

a,b,c,d
1,2,3,4
5,6,7,8
9,10,11,12

In [38]:
df=pd.read_csv(StringIO(data),dtype=int)

In [39]:
df

   a   b   c   d
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [40]:
df['a'][1].................#indexing

SyntaxError: invalid syntax (991164552.py, line 1)

In [41]:
df['a']

0    1
1    5
2    9
Name: a, dtype: int32

In [42]:
##diff b/w Int64 n Int32
##Int32 can store values up to 2,147,483,647 and 
##Int64 can store values up to 9,223,372,036,854,775,807 . 


df=pd.read_csv(StringIO(data),dtype={'b':int,'c':float,'a':'Int64'})

In [43]:
df

   a   b     c   d
0  1   2   3.0   4
1  5   6   7.0   8
2  9  10  11.0  12

In [44]:
type(df['a'][1])

numpy.int64

In [45]:
##check datatypes

df.dtypes

a      Int64
b      int32
c    float64
d      int64
dtype: object

In [46]:
data=('index,a,b,c\n'
     '4,apple,bat,5.7\n'
     '8,orange,cow,10')

In [47]:
print(data)

index,a,b,c
4,apple,bat,5.7
8,orange,cow,10

In [48]:
pd.read_csv(StringIO(data))

   index       a    b     c
0      4   apple  bat   5.7
1      8  orange  cow  10.0

In [49]:
data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow,')

In [50]:
pd.read_csv(StringIO(data))

        a    b   c
4   apple  bat NaN
8  orange  cow NaN

In [51]:
pd.read_csv(StringIO(data),index_col=False)

   a       b    c
0  4   apple  bat
1  8  orange  cow

In [52]:
##Combining usecols and index_cols

data=('a,b,c\n'
     '4,apple,bat,\n'
     '8,orange,cow,')

In [53]:
pd.read_csv(StringIO(data),index_col=False,usecols=['b','c'])

        b    c
0   apple  bat
1  orange  cow

In [54]:
##Quoting and Escape Characters very useful in NLP

data='a,b\n"hello,\\"Isha\\",Nice to meet you",5'

In [55]:
pd.read_csv(StringIO(data),escapechar='\\')

                               a  b
0  hello,"Isha",Nice to meet you  5

## Read JSON to CSV

In [62]:
data1='{"employee_name":"James","email":"xyz@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr.develop"}]}'
df1=pd.read_json(data1)

## Reading HTML content

In [64]:
url_mcc='https://en.wikipedia.org/wiki/Mobile_country_code'
dfs=pd.read_html(url_mcc,match='Country',header=0)

In [65]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

## Read Excel file

In [66]:
df_excel=pd.read_excel('Excel_Sample.xlsx')

FileNotFoundError: [Errno 2] No such file or directory: 'Excel_Sample.xlsx'